public class Test {
    public static void main(String[] args){
        //  java用Unicode字符集 65535个字符
        //  标志符 ：是由字母、数字、下划线及美元符号等组成一个字符序列，用来表示
        // 变量、方法名称、类名、接口等
        // 标识符规则
        //1.不能以数字开头
        //2.第一个字符之后可以是货币符号、连字符或数字、字母、汉字的任意组合
        //3.标识符的字符数量没有限制，一般不要太长
        //4.Java的关键字（保留字）不能做标识符
        //5.Java区分大小写
        //6.标识符中不能包含空格、单引号、双引号、分好等
        System.out.println("11");
    }

    /**
     * 文档注释
     **/
    public static void 我的方法() {
        /*
        块注释
         */
    }
}
